# Для начала кратко ознакомтесь с тем, что представляет из себя численный метод дифференцирования
# https://en.wikipedia.org/wiki/Numerical_differentiation
#
# Запрограммируем функцию x1^2+x2^3-x1*x2
my_func <- function(x)
{
  return(x[1] ^ 2 + x[2] ^ 3 - x[1] * x[2])
}
# Найдем её частные производные в точке (2,3) при помощи численного метода дифференцирования
# При этом настоящие значения производных в этой точке равны 1 и 25 соответственно
delta <- 0.00001                                                        # выберем маленькое приращение
d_my_func_d_x1 <- (my_func(c(2 + delta, 3)) - my_func(c(2, 3))) / delta # частная производная по x1
d_my_func_d_x2 <- (my_func(c(2, 3 + delta)) - my_func(c(2, 3))) / delta # частная производная по x2
matrix(c(d_my_func_d_x1, d_my_func_d_x2), ncol = 1)                     # численный градиент
# Теперь повторим это при помощи специальной встроенной функции
install.packages("numDeriv")
library("numDeriv")
grad(func = my_func,         # выбираем фукцию которую будем дифференцировать
     x = c(2, 3))            # выбираем точку, в которой будем искать градиент (вектор частных производных)
# По аналогии нетрудно рассчитать и Гессиан
hessian(func = my_func, x = c(2, 3))