### em301, первый семинар в R
# if you can't read russian letters just do "File"-"Reopen with Encoding"-"UTF-8"

### Первые заповеди...
# Не помяни русские буквы или пробелы в имени файла твоего
# Не помяни запятую в качестве десятичного разделителя числа твоего
# Не используй никаких форматов хранения данных кроме csv пока не превышен будет объём диска твоего
# Почитай кодировку UTF-8 для русскоязычных текстов, чтобы продлились дни их на земле 
# Проверяй целостность данных после загрузки и преобразований
# Комментируй свой код щедро и обильно
# Руководствуйся google style guide при оформлении кода своего
# Сохраняй seed в случайных экспериментах, дабы были они воспроизводимы
# Используй систему контроля версий
# 



### Спасите-помогите!

# доска сообщений с вопросам по статистике/эконометрике/R
# stats.stackexchange.com

# доска сообщений с вопросам по программированию
# stackoverflow.com

# Google

# Книжки, свободно гуглятся
# Introduction to R
# Econometrics in R
# The R inferno

# if you know the name of the function
help(glm)

# if you don't know the name of the function
??regression

### R как калькулятор
a=5
b=6
a+b # is equivalent to `print(a+b)`
factorial(10) # 10!


### Особые числа 
# NA = not available, нет наблюдения
# Inf = + infinity
# NaN = not a number

1/0
NA+5
0/0


### Данные
# по типу: текстовые, логические, числа, факторные переменные, упорядоченные, Date
# по форме: вектор, матрица, список, таблица данных

a=c("Москва","Питер","Лондон")
b=c(TRUE,TRUE,FALSE)

sex=c('Male','Female','Male')
s=factor(sex)

# создадим вектор из 200 нормально распределенных случайных величин N(7,3^2)
nn=rnorm(200,mean=7,sd=3)

# создадим вектор из подряд идущих чисел
v=3:50

# создадим вектор из одинаковых чисел
v=rep(777,times=50)
# попробуйте
w=rep(c(1,2,3),times=10)

# упорядоченные качественные переменные
edu=c('school','school','bac','master')
edu2=ordered(edu,labels=c('school','bac','master'))

### функция str - друг, товарищ и брат!

# узнаём формат объекта
str(nn)
# узнаём краткое описание объекта
summary(nn)

# сравните:
str(edu)
str(edu2)

# создаём матрицу 3*4, где в каждой ячейке стоит 777
A7=matrix(777,nrow=3,ncol=4)

# создаём диагональную матрицу, с числами 3, 7 и 8.
Ad=diag(c(3,7,8))

# Упражнение
privet=rep("Привет!",times=200)
eps=rnorm(n=200,mean=0,sd=6)
x=rnorm(n=200,mean=3,sd=5)
y=2+10*x+eps

### простейшие графики:
hist(y)
plot(x,y)

# матрица может содержать только векторы одного типа. 
# Только числа или только текстовые переменные
A=cbind(y,x,eps) # получилась матрица, склеивали y, x и eps как столбики
B=rbind(y,x,eps) # получилась матрица, склеивали y, x и eps как строки


# data frame может содержать столбики разного типа
d=data.frame(x,y,eps,privet) # получилась таблица данных


str(d)
summary(d)


### Выбор элемента, строки, столбца, нескольких столбцов

# конкретный элемент матрицы
A[2,3]

# строка
A[2,]

# столбец
A[,3]

# строки с 10 по 15-ую
A[10:15,]

# строки номер 7, 23 и 35
A[c(7,23,35),]

# столбец по имени из data frame
d$x
summary(d$x)


### glm - наша рабочая лошадка

model1=glm(y~x,data=d)
summary(model1)

model2=glm(y~x+cos(x),data=d)
summary(model2)


### Загрузка данных

# SET Working Directory
setwd('science/econometrix/em301/datasets/')

# read simple csv file into dataframe
d=read.table('tvims2012_data.csv',header=TRUE,sep=",")

# csv файл представляет собой простой текстовый файл, 
# который можно открыть в любом текстовом редакторе
# в качестве десятичного разделителя нужно использовать точку
# разные переменные разделяет запятая

