# em301, первый семинар в R

# Спасите-помогите, ссылки

# R как калькулятор

# Особые числа 

# Данные
# по типу: текстовые, логические, числа, порядковые переменные, упорядоченные, Date
# по форме: вектор, матрица, список, таблица данных

# функция str - друг, товарищ и брат!

# работа с векторами/матрицами/таблицами данных 
# имена строк/столбцов
# Выбор элемента, строки, столбца, нескольких столбцов
# склеивание
# размер вектора/матрицы
# выбор части вектора


# удалить объект


# Загрузить данные
# из файла (csv, stata, spss) или с сайта

# Оценивать glm разные модели






