# Задача на мультиномиальное(многомерное биномиальное распределение)
# Пусть в лесу водятся волк(0,3), Баба Яга(0,1), Харис(0,4).
# Пусть мы 100 раз ходим в лес. Многомерный вектор(кол-во встреч с каждым) имеет мультиномиальное распределение.
# P(X_1=10, X_2=20, X_3=70) = ? 0.3^10 * 0.1^20 * 0.6^70
# P(X_1=10, X_2=20, X_3=70) = C^10_100 * C^20_90 * 0.3^10 * 0.1^20 * 0.6^70
# C = 100!/(10!*20!*70!) - полиномиальный коэффициент
# X ~ Mult(n, d(p_1, p_2, p_3))
# E[X] = (n*p_1, n*p_2, n*p_3)
# Var[X] = [(n*p_1(1-p_1), , ), ( ,n*p_2(1-p_2), ), ( , ,n*p_3(1-p_3))]
# Var[X_1] = Var[I_1 + I_2 + ... + I_n] = n * Var[I_1], т.к. дисперсии независимы
# I_1 = 0, 1 - p
# I_1 = 1, p
# Cov(X_1, X_2) = Cov(I_1 + I_2 + ... + I_n, X_2) = ...
# Cov(I^1_i, I^2_i)
# I^1_2 - был ли во второй день волк?
# I^2_5 - была ли во второй день Баба Яга?
# Cov(X_1, X_2) = \sum_i=1_100 Cov(I^1_i, I^2_i) + 100 Cov(I^1, I^2)
# Cov(I^1, I^2) = E[I^1_1 * I^2_1] - E[I^1_1]*E[I^2_1] = 0 - p_1
*p_2 = - p_1*p_2
# Нам нужна матрица, где A_ij = - p_i*p_j. Тогда A = -p*p^T
# p - столбец
# p^T - строка
# Cov(...) = n * ([p_1, , ), ( ,p_2, ), ( , ,p_3)] - p*p^T)

# Справка:
# Симплекс
# x \in R^n
# \triangle = {x | x_i >= 0, x_1 + x_2 + ... + x_n = 1}

# Упражнение:
# 100 дней в лес ходим
# 10 волков
# 20 Бабушек Ёжек
# 70 Харисов
# X ~ Mult(n = 100, p = (p_1, p_2, p_3))
# Волки водятся также часто, как и Бабки Ёжки (априорно известно нам)
# Тогда вероятность волка \alpha, Бабки Ёжки \alpha, Хариса: (1 - 2*\alpha)
# Априорно: \alpha ~ uni(0, 1/2)

# Самый современный пакет для вероятностного программирования - Edward

# Теперь со stan:
library('tidyverse')
library('rstan')
library('bayesplot')

model <- stan_model(file = 'sem_06.02.stan')

data_1 <- list(N=10, y = c(3, 1, 6))

fit <- sampling(model, data = data_1)
fit


